x = float(input("Введіть координату x для точки A: "))
y = float(input("Введіть координату y для точки A: "))

if x == 0 and y == 0:
    print("Точка A знаходиться в початку координат.")
elif x == 0:
    print("Точка A знаходиться на осі Y.")
elif y == 0:
    print("Точка A знаходиться на осі X.")
elif x > 0 and y > 0:
    print("Точка A знаходиться в першому квадранті.")
elif x < 0 and y > 0:
    print("Точка A знаходиться в другому квадранті.")
elif x < 0 and y < 0:
    print("Точка A знаходиться в третьому квадранті.")
elif x > 0 and y < 0:
    print("Точка A знаходиться в четвертому квадранті.")
